# Data Cleaning

1. data in wrong format
2. missing datas
3. outliers
4. duplicates

if value is categorical we use mode

remove column if there is many null data, because it is insignificant

#### pd.DataFrame.drop()

#### this is used to drop a column

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic_test.csv')

### drop() does not modify the real df so when df is printed, there is PassengerId

In [3]:
df.drop('PassengerId', axis=1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Qv

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Qv

### if we put inplace=True then the real df is also changed so PassengerId is deleted from df

In [7]:
df.drop('PassengerId', axis=1,inplace=True)

In [8]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Qv

In [9]:
df.drop(['Survived', 'Pclass'], axis=1,inplace=True)

In [10]:
df

,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Qv

In [11]:
df = pd.read_csv('titanic_test.csv')

In [12]:
df.drop('Cabin', axis=1, inplace=True)

In [13]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Qv

## dropna()
#### dont drop the needed values, always be careful

In [14]:
df = pd.read_csv('titanic_test.csv')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Feature Engineering : reduces the number of inputs

### to drop a row we use dropna()
#### like pd.NA, np.NAN and all

## Univariate Analysis: there is only one variable.

## PCA Principal Component Analysis: It is a dimensional reduction technique

In [17]:
df.dropna(inplace=True)

In [18]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

### this drops all the values so the data is lost for Cabin and Age, we still need the Age so we use subset.

In [20]:
df.dropna(subset=['Age'], inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

### Here the na values are deleted for Age so we get that from df.info()

In [24]:
df = pd.read_csv('titanic_test.csv')

In [25]:
df.Age.fillna(df.Age.mean(), inplace=True)

df['Date']= pd.to_datetime(df['Date']) for date

In [27]:
df.Age.loc[0]

22.0

In [29]:
df.loc[0, 'Age'] = 105

In [34]:
for index in df.index:
    print(df.loc[index, 'Age'])

105.0
38.0
26.0
35.0
35.0
29.69911764705882
54.0
2.0
27.0
14.0
4.0
58.0
20.0
39.0
14.0
55.0
2.0
29.69911764705882
31.0
29.69911764705882
35.0
34.0
15.0
28.0
8.0
38.0
29.69911764705882
19.0
29.69911764705882
29.69911764705882
40.0
29.69911764705882
29.69911764705882
66.0
28.0
42.0
29.69911764705882
21.0
18.0
14.0
40.0
27.0
29.69911764705882
3.0
19.0
29.69911764705882
29.69911764705882
29.69911764705882
29.69911764705882
18.0
7.0
21.0
49.0
29.0
65.0
29.69911764705882
21.0
28.5
5.0
11.0
22.0
38.0
45.0
4.0
29.69911764705882
29.69911764705882
29.0
19.0
17.0
26.0
32.0
16.0
21.0
26.0
32.0
25.0
29.69911764705882
29.69911764705882
0.83
30.0
22.0
29.0
29.69911764705882
28.0
17.0
33.0
16.0
29.69911764705882
23.0
24.0
29.0
20.0
46.0
26.0
59.0
29.69911764705882
71.0
23.0
34.0
34.0
28.0
29.69911764705882
21.0
33.0
37.0
28.0
21.0
29.69911764705882
38.0
29.69911764705882
47.0
14.5
22.0
20.0
17.0
21.0
70.5
29.0
24.0
2.0
21.0
29.69911764705882
32.5
32.5
54.0
12.0
29.69911764705882
24.0
29.69911764705882
45.0
33.0
20.0
47.0
29.0
25.0
23.0
19.0
37.0
16.0
24.0
29.69911764705882
22.0
24.0
19.0
18.0
19.0
27.0
9.0
36.5
42.0
51.0
22.0
55.5
40.5
29.69911764705882
51.0
16.0
30.0
29.69911764705882
29.69911764705882
44.0
40.0
26.0
17.0
1.0
9.0
29.69911764705882
45.0
29.69911764705882
28.0
61.0
4.0
1.0
21.0
56.0
18.0
29.69911764705882
50.0
30.0
36.0
29.69911764705882
29.69911764705882
9.0
1.0
4.0
29.69911764705882
29.69911764705882
45.0
40.0
36.0
32.0
19.0
19.0
3.0
44.0
58.0
29.69911764705882
42.0
29.69911764705882
24.0
28.0
29.69911764705882
34.0
45.5
18.0
2.0
32.0
26.0
16.0
40.0
24.0
35.0
22.0
30.0
29.69911764705882
31.0
27.0
42.0
32.0
30.0
16.0
27.0
51.0
29.69911764705882
38.0
22.0
19.0
20.5
18.0
29.69911764705882
35.0
29.0
59.0
5.0
24.0
29.69911764705882
44.0
8.0
19.0
33.0
29.69911764705882
29.69911764705882
29.0
22.0
30.0
44.0
25.0
24.0
37.0
54.0
29.69911764705882
29.0
62.0
30.0
41.0
29.0
29.69911764705882
30.0
35.0
50.0
29.69911764705882
3.0
52.0
40.0
29.69911764705882
36.0
16.0
25.0
58.0
35.0
29.69911764705882
25.0
41.0
37.0
29.69911764705882
63.0
45.0
29.69911764705882
7.0
35.0
65.0
28.0
16.0
19.0
29.69911764705882
33.0
30.0
22.0
42.0
22.0
26.0
19.0
36.0
24.0
24.0
29.69911764705882
23.5
2.0
29.69911764705882
50.0
29.69911764705882
29.69911764705882
19.0
29.69911764705882
29.69911764705882
0.92
29.69911764705882
17.0
30.0
30.0
24.0
18.0
26.0
28.0
43.0
26.0
24.0
54.0
31.0
40.0
22.0
27.0
30.0
22.0
29.69911764705882
36.0
61.0
36.0
31.0
16.0
29.69911764705882
45.5
38.0
16.0
29.69911764705882
29.69911764705882
29.0
41.0
45.0
45.0
2.0
24.0
28.0
25.0
36.0
24.0
40.0
29.69911764705882
3.0
42.0
23.0
29.69911764705882
15.0
25.0
29.69911764705882
28.0
22.0
38.0
29.69911764705882
29.69911764705882
40.0
29.0
45.0
35.0
29.69911764705882
30.0
60.0
29.69911764705882
29.69911764705882
24.0
25.0
18.0
19.0
22.0
3.0
29.69911764705882
22.0
27.0
20.0
19.0
42.0
1.0
32.0
35.0
29.69911764705882
18.0
1.0
36.0
29.69911764705882
17.0
36.0
21.0
28.0
23.0
24.0
22.0
31.0
46.0
23.0
28.0
39.0
26.0
21.0
28.0
20.0
34.0
51.0
3.0
21.0
29.69911764705882
29.69911764705882
29.69911764705882
33.0
29.69911764705882
44.0
29.69911764705882
34.0
18.0
30.0
10.0
29.69911764705882
21.0
29.0
28.0
18.0
29.69911764705882
28.0
19.0
29.69911764705882
32.0
28.0
29.69911764705882
42.0
17.0
50.0
14.0
21.0
24.0
64.0
31.0
45.0
20.0
25.0
28.0
29.69911764705882
4.0
13.0
34.0
5.0
52.0
36.0
29.69911764705882
30.0
49.0
29.69911764705882
29.0
65.0
29.69911764705882
50.0
29.69911764705882
48.0
34.0
47.0
48.0
29.69911764705882
38.0
29.69911764705882
56.0
29.69911764705882
0.75
29.69911764705882
38.0
33.0
23.0
22.0
29.69911764705882
34.0
29.0
22.0
2.0
9.0
29.69911764705882
50.0
63.0
25.0
29.69911764705882
35.0
58.0
30.0
9.0
29.69911764705882
21.0
55.0
71.0
21.0
29.69911764705882
54.0
29.69911764705882
25.0
24.0
17.0
21.0
29.69911764705882
37.0
16.0
18.0
33.0
29.69911764705882
28.0
26.0
29.0
29.69911764705882
36.0
54.0
24.0
47.0
34.0
29.69911764705882
36.0
32.0
30.0
22.0
29.69911764705882
44.0
29.69911764705882
40.5
50.0
29.69911764705882
39.0
23.0
2.0
29.69911764705882
17.0
29.69911764705882
30.0
7.0
45.0
30.0
29.69911764705882
22.0
36.0
9.0
11.0
32.0
50.0
64.0
19.0
29.69911764705882
33.0
8.0
17.0
27.0
29.69911764705882
22.0
22.0
62.0
48.0
29.69911764705882
39.0
36.0
29.69911764705882
40.0
28.0
29.69911764705882
29.69911764705882
24.0
19.0
29.0
29.69911764705882
32.0
62.0
53.0
36.0
29.69911764705882
16.0
19.0
34.0
39.0
29.69911764705882
32.0
25.0
39.0
54.0
36.0
29.69911764705882
18.0
47.0
60.0
22.0
29.69911764705882
35.0
52.0
47.0
29.69911764705882
37.0
36.0
29.69911764705882
49.0
29.69911764705882
49.0
24.0
29.69911764705882
29.69911764705882
44.0
35.0
36.0
30.0
27.0
22.0
40.0
39.0
29.69911764705882
29.69911764705882
29.69911764705882
35.0
24.0
34.0
26.0
4.0
26.0
27.0
42.0
20.0
21.0
21.0
61.0
57.0
21.0
26.0
29.69911764705882
80.0
51.0
32.0
29.69911764705882
9.0
28.0
32.0
31.0
41.0
29.69911764705882
20.0
24.0
2.0
29.69911764705882
0.75
48.0
19.0
56.0
29.69911764705882
23.0
29.69911764705882
18.0
21.0
29.69911764705882
18.0
24.0
29.69911764705882
32.0
23.0
58.0
50.0
40.0
47.0
36.0
20.0
32.0
25.0
29.69911764705882
43.0
29.69911764705882
40.0
31.0
70.0
31.0
29.69911764705882
18.0
24.5
18.0
43.0
36.0
29.69911764705882
27.0
20.0
14.0
60.0
25.0
14.0
19.0
18.0
15.0
31.0
4.0
29.69911764705882
25.0
60.0
52.0
44.0
29.69911764705882
49.0
42.0
18.0
35.0
18.0
25.0
26.0
39.0
45.0
42.0
22.0
29.69911764705882
24.0
29.69911764705882
48.0
29.0
52.0
19.0
38.0
27.0
29.69911764705882
33.0
6.0
17.0
34.0
50.0
27.0
20.0
30.0
29.69911764705882
25.0
25.0
29.0
11.0
29.69911764705882
23.0
23.0
28.5
48.0
35.0
29.69911764705882
29.69911764705882
29.69911764705882
36.0
21.0
24.0
31.0
70.0
16.0
30.0
19.0
31.0
4.0
6.0
33.0
23.0
48.0
0.67
28.0
18.0
34.0
33.0
29.69911764705882
41.0
20.0
36.0
16.0
51.0
29.69911764705882
30.5
29.69911764705882
32.0
24.0
48.0
57.0
29.69911764705882
54.0
18.0
29.69911764705882
5.0
29.69911764705882
43.0
13.0
17.0
29.0
29.69911764705882
25.0
25.0
18.0
8.0
1.0
46.0
29.69911764705882
16.0
29.69911764705882
29.69911764705882
25.0
39.0
49.0
31.0
30.0
30.0
34.0
31.0
11.0
0.42
27.0
31.0
39.0
18.0
39.0
33.0
26.0
39.0
35.0
6.0
30.5
29.69911764705882
23.0
31.0
43.0
10.0
52.0
27.0
38.0
27.0
2.0
29.69911764705882
29.69911764705882
1.0
29.69911764705882
62.0
15.0
0.83
29.69911764705882
23.0
18.0
39.0
21.0
29.69911764705882
32.0
29.69911764705882
20.0
16.0
30.0
34.5
17.0
42.0
29.69911764705882
35.0
28.0
29.69911764705882
4.0
74.0
9.0
16.0
44.0
18.0
45.0
51.0
24.0
29.69911764705882
41.0
21.0
48.0
29.69911764705882
24.0
42.0
27.0
31.0
29.69911764705882
4.0
26.0
47.0
33.0
47.0
28.0
15.0
20.0
19.0
29.69911764705882
56.0
25.0
33.0
22.0
28.0
25.0
39.0
27.0
19.0
29.69911764705882
26.0
32.0

In [35]:
for index in df.index:
    if df.loc[index, 'Age'] > 90:
        df.loc[index, 'Age'] = 90

In [36]:
df.Age.max()

90.0

### since Age cannot be 105 so we cleaned the data by replacing all the bad value which is greater than 90 to 90.

In [38]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan, 'Qv'], dtype=object)

In [39]:
df.Embarked.isnull().sum()

2

In [40]:
df.Embarked.mode()

0    S
Name: Embarked, dtype: object

In [41]:
df.Embarked.fillna(df.Embarked.mode(), inplace=True)

## how many people from a location

In [42]:
df.Embarked.mode()

0    S
Name: Embarked, dtype: object

## how many people get on boat from the max people location

In [46]:
df[df.Embarked == df.Embarked.mode().iloc[0]].Embarked.count()

644